MikroElektronika/core_packages/ARM/gcc_clang/def/ti/MSPM0C1104/mcu.h
/* IOMUX_PINCM21[PF] Bits */
#define IOMUX_PINCM21_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM21_PF_GPIOA_DIO20                  ((uint32_t)0X00000001)
#define IOMUX_PINCM21_PF_DEBUGSS_SWCLK                ((uint32_t)0X00000002)
#define IOMUX_PINCM21_PF_TIMA_FAULT1                  ((uint32_t)0X00000003)
#define IOMUX_PINCM21_PF_SPI0_PICO                    ((uint32_t)0X00000004)
#define IOMUX_PINCM21_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM21_PF_TIMA0_CCP0                   ((uint32_t)0X00000006)
#define IOMUX_PINCM21_PF_UART0_RTS                    ((uint32_t)0X00000007)

/* IOMUX_PINCM23[PF] Bits */
#define IOMUX_PINCM23_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM23_PF_GPIOA_DIO22                  ((uint32_t)0X00000001)
#define IOMUX_PINCM23_PF_UART0_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM23_PF_SPI0_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM23_PF_UART0_RTS                    ((uint32_t)0X00000004)
#define IOMUX_PINCM23_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000005)
#define IOMUX_PINCM23_PF_TIMA0_CCP1                   ((uint32_t)0X00000006)

/* IOMUX_PINCM24[PF] Bits */
#define IOMUX_PINCM24_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM24_PF_GPIOA_DIO23                  ((uint32_t)0X00000001)
#define IOMUX_PINCM24_PF_UART0_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM24_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000003)
#define IOMUX_PINCM24_PF_TIMG14_CCP0                  ((uint32_t)0X00000004)
#define IOMUX_PINCM24_PF_UART0_CTS                    ((uint32_t)0X00000005)
#define IOMUX_PINCM24_PF_TIMA0_CCP3                   ((uint32_t)0X00000006)
#define IOMUX_PINCM24_PF_TIMG14_CCP1                  ((uint32_t)0X00000007)

/* IOMUX_PINCM25[PF] Bits */
#define IOMUX_PINCM25_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM25_PF_GPIOA_DIO24                  ((uint32_t)0X00000001)
#define IOMUX_PINCM25_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000002)
#define IOMUX_PINCM25_PF_TIMG14_CCP1                  ((uint32_t)0X00000003)
#define IOMUX_PINCM25_PF_UART0_RTS                    ((uint32_t)0X00000004)
#define IOMUX_PINCM25_PF_TIMG14_CCP2                  ((uint32_t)0X00000005)
#define IOMUX_PINCM25_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000006)
#define IOMUX_PINCM25_PF_UART0_RX                     ((uint32_t)0X00000007)

/* IOMUX_PINCM26[PF] Bits */
#define IOMUX_PINCM26_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM26_PF_GPIOA_DIO25                  ((uint32_t)0X00000001)
#define IOMUX_PINCM26_PF_TIMG14_CCP3                  ((uint32_t)0X00000002)
#define IOMUX_PINCM26_PF_UART0_TX                     ((uint32_t)0X00000003)
#define IOMUX_PINCM26_PF_SPI0_PICO                    ((uint32_t)0X00000004)
#define IOMUX_PINCM26_PF_TIMG14_CCP1                  ((uint32_t)0X00000005)
#define IOMUX_PINCM26_PF_TIMA_FAULT2                  ((uint32_t)0X00000006)

/* IOMUX_PINCM27[PF] Bits */
#define IOMUX_PINCM27_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM27_PF_GPIOA_DIO26                  ((uint32_t)0X00000001)
#define IOMUX_PINCM27_PF_TIMG8_CCP0                   ((uint32_t)0X00000002)
#define IOMUX_PINCM27_PF_UART0_RX                     ((uint32_t)0X00000003)
#define IOMUX_PINCM27_PF_SPI0_POCI                    ((uint32_t)0X00000004)
#define IOMUX_PINCM27_PF_SYSCTL_BEEPER                ((uint32_t)0X00000005)
#define IOMUX_PINCM27_PF_TIMG14_CCP0                  ((uint32_t)0X00000006)
#define IOMUX_PINCM27_PF_TIMA_FAULT0                  ((uint32_t)0X00000007)

/* IOMUX_PINCM28[PF] Bits */
#define IOMUX_PINCM28_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM28_PF_GPIOA_DIO27                  ((uint32_t)0X00000001)
#define IOMUX_PINCM28_PF_TIMG8_CCP1                   ((uint32_t)0X00000002)
#define IOMUX_PINCM28_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000003)
#define IOMUX_PINCM28_PF_TIMA0_CCP0_CMPL              ((uint32_t)0X00000004)
#define IOMUX_PINCM28_PF_UART0_TX                     ((uint32_t)0X00000005)
#define IOMUX_PINCM28_PF_SPI0_POCI                    ((uint32_t)0X00000006)
#define IOMUX_PINCM28_PF_TIMA_FAULT2                  ((uint32_t)0X00000007)

/* IOMUX_PINCM29[PF] Bits */
#define IOMUX_PINCM29_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM29_PF_GPIOA_DIO28                  ((uint32_t)0X00000001)
#define IOMUX_PINCM29_PF_TIMA0_CCP0                   ((uint32_t)0X00000002)
#define IOMUX_PINCM29_PF_UART0_RX                     ((uint32_t)0X00000005)
#define IOMUX_PINCM29_PF_TIMG8_IDX                    ((uint32_t)0X00000007)

#if   defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif (defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050))
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif

/*@}*/ /* end of group MSPM0C110X_PeripheralDecl */

/*@}*/ /* end of group MSPM0C110X_Definitions */

#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_m0p_mspm0c110x__include */

